<?php
return [
    31001 => array (
        "code" => - 31001,
        "message" => array (
            "ru" => "Неверная сумма",
            "uz" => "Неверная сумма",
            "en" => "Неверная сумма"
        ),
        "data" => null
    ),
    31003 => array (
        "code" => - 31003,
        "message" => array (
            "ru" => "Транзакция не найдена",
            "uz" => "Транзакция не найдена",
            "en" => "Транзакция не найдена"
        ),
        "data" => null
    ),
    31007 => array (
        "code" => - 31007,
        "message" => array (
            "ru" => "Невозможно отменить транзакцию, заказ выполнен",
            "uz" => "Невозможно отменить транзакцию, заказ выполнен",
            "en" => "Невозможно отменить транзакцию, заказ выполнен"
        ),
        "data" => null
    ),
    31008 => array (
        "code" => - 31008,
        "message" => array (
            "ru" => "Невозможно выполнить данную операцию",
            "uz" => "Невозможно выполнить данную операцию",
            "en" => "Невозможно выполнить данную операцию"
        ),
        "data" => null
    ),
    31050 => array (
        "code" => - 31050,
        "message" => array (
            "ru" => "Заказ не найден",
            "uz" => "Заказ не найден",
            "en" => "Заказ не найден"
        ),
        "data" => null
    ),
	31051 => array (
		"code" => - 31051,
		"message" => array (
			"ru"=>'Существует транзакция.',
			"uz"=>'Существует транзакция.',
			"en"=>'Существует транзакция.'
		),
		"data" => null
	),
	31052 => array (
		"code" => - 31052,
		"message" => array (
			"ru"=>'Заказ уже оплачен.',
			"uz"=>'Заказ уже оплачен.',
			"en"=>'Заказ уже оплачен.'
		),
		"data" => null
	),
	32300 => array (
		"code" => - 32300,
		"message" => array (
			"ru"=>'Ошибка возникает если метод запроса не POST.',
			"uz"=>'Ошибка возникает если метод запроса не POST.',
			"en"=>'Ошибка возникает если метод запроса не POST.'
		),
		"data" => null
	),
	32600 => array (
		"code" => - 32600,
		"message" => array (
			"ru"=>'Отсутствуют обязательные поля в RPC-запросе или тип полей не соответствует спецификации',
			"uz"=>'Отсутствуют обязательные поля в RPC-запросе или тип полей не соответствует спецификации',
			"en"=>'Отсутствуют обязательные поля в RPC-запросе или тип полей не соответствует спецификации'
		),
		"data" => null
	),
	32601 => array (
		"code" => - 32601,
		"message" => array (
			"ru"=>'Запрашиваемый метод не найден. В RPC-запросе имя запрашиваемого метода содержится в поле data.',
			"uz"=>'Запрашиваемый метод не найден. В RPC-запросе имя запрашиваемого метода содержится в поле data.',
			"en"=>'Запрашиваемый метод не найден. В RPC-запросе имя запрашиваемого метода содержится в поле data.'
		),
		"data" => null
	),
	32700 => array (
		"code" => - 32700,
		"message" => array (
			"ru"=>'Ошибка парсинга JSON.',
			"uz"=>'Ошибка парсинга JSON.',
			"en"=>'Ошибка парсинга JSON.'
		),
		"data" => null
	),
    31099 => array (
        "code" => - 31099,
        "message" => array (
            "ru" => "Заказ уже оплачен или в ожидании платежа",
            "uz" => "Заказ уже оплачен или в ожидании платежа",
            "en" => "Заказ уже оплачен или в ожидании платежа"
        ),
        "data" => null
    ),
	32400 => array (
		"code" => - 32400,
		"message" => array (
			"ru"=>'Системная (внутренняя ошибка). Ошибку следует использовать в случае системных сбоев: отказа базы данных, отказа файловой системы, неопределенного поведения и т.д.',
			"uz"=>'Системная (внутренняя ошибка). Ошибку следует использовать в случае системных сбоев: отказа базы данных, отказа файловой системы, неопределенного поведения и т.д.',
			"en"=>'Системная (внутренняя ошибка). Ошибку следует использовать в случае системных сбоев: отказа базы данных, отказа файловой системы, неопределенного поведения и т.д.'
		),
		"data" => null
	),
    32504 => array (
        "code" => - 32504,
        "message" => array (
        	"ru"=>'Недостаточно привилегий для выполнения метода.',
        	"uz"=>'Недостаточно привилегий для выполнения метода.',
        	"en"=>'Недостаточно привилегий для выполнения метода.'
        ),
        "data" => null
    )
];
?>